# GetDefOpacityByClsN

## Description
```pascal
PROCEDURE GetDefOpacityByClsN(
				VAR outDefFillOpacityByClass : BOOLEAN;
				VAR outDefPenOpacityByClass  : BOOLEAN);
```

```python

def vs.GetDefOpacityByClsN():
    return (outDefFillOpacityByClass, outDefPenOpacityByClass)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outDefFillOpacityByClass|BOOLEAN||
|outDefPenOpacityByClass|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* Document Attributes